app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" ORDER BY created_at DESC
---
  def index
    @comments = Comment.all

INSERT INTO "comments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 28 Apr 2014 06:30:16 UTC +00:00], ["updated_at", Mon, 28 Apr 2014 06:30:16 UTC +00:00]]
---
  def create
    @comment = current_user.comments.create(comment_params)

UPDATE "comments" SET "updated_at" = ? WHERE "comments"."id" = 1  [["updated_at", Mon, 28 Apr 2014 12:05:27 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)