app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "created_at", "description", "latitude", "longitude", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save